espressif/arduino-esp32/libraries/ESP_I2S/src/ESP_I2S.cpp
// 16-bit wrappers (all targets — used by I2S_RX_TRANSFORM_16_STEREO_TO_MONO)
static esp_err_t
  i2s_channel_read_16_stereo_to_mono_left(i2s_chan_handle_t handle, char *read_buff, void *dst, size_t len, size_t *bytes_read, uint32_t timeout_ms) {
  return i2s_channel_read_stereo_to_mono(handle, read_buff, dst, len, bytes_read, timeout_ms, 0, false);
}

static esp_err_t
  i2s_channel_read_16_stereo_to_mono_right(i2s_chan_handle_t handle, char *read_buff, void *dst, size_t len, size_t *bytes_read, uint32_t timeout_ms) {
  return i2s_channel_read_stereo_to_mono(handle, read_buff, dst, len, bytes_read, timeout_ms, 1, false);
}

static esp_err_t
  i2s_channel_read_16_stereo_to_mono_both(i2s_chan_handle_t handle, char *read_buff, void *dst, size_t len, size_t *bytes_read, uint32_t timeout_ms) {
  return i2s_channel_read_stereo_to_mono(handle, read_buff, dst, len, bytes_read, timeout_ms, 2, false);
}

#if SOC_I2S_HW_VERSION_1
// Unpack stereo 8-bit: each DMA uint16_t → one int8_t (high byte)
static esp_err_t i2s_channel_read_8_unpack(i2s_chan_handle_t handle, char *read_buff, void *dst, size_t len, size_t *bytes_read, uint32_t timeout_ms) {
  size_t out_len = 0;
  size_t read_buff_len = len * 2;
  if (read_buff == NULL) {
    log_e("Temp buffer is NULL!");
    return ESP_FAIL;
  }
  esp_err_t err = i2s_channel_read(handle, read_buff, read_buff_len, &out_len, timeout_ms);
  if (err != ESP_OK) {
    *bytes_read = 0;
    return err;
  }
  size_t n_samples = out_len / 2;
  uint8_t *ds = (uint8_t *)dst;
  uint16_t *src = (uint16_t *)read_buff;
  for (size_t i = 0; i < n_samples; i++) {
    ds[i] = (uint8_t)(src[i] >> 8);
  }
  *bytes_read = n_samples;
  return ESP_OK;
}

// 8-bit mono wrappers (ESP32 HW v1 only — mono workaround + uint16_t packing)
static esp_err_t
  i2s_channel_read_8_stereo_to_mono_left(i2s_chan_handle_t handle, char *read_buff, void *dst, size_t len, size_t *bytes_read, uint32_t timeout_ms) {
  return i2s_channel_read_stereo_to_mono(handle, read_buff, dst, len, bytes_read, timeout_ms, 0, true);
}

static esp_err_t
  i2s_channel_read_8_stereo_to_mono_right(i2s_chan_handle_t handle, char *read_buff, void *dst, size_t len, size_t *bytes_read, uint32_t timeout_ms) {
  return i2s_channel_read_stereo_to_mono(handle, read_buff, dst, len, bytes_read, timeout_ms, 1, true);
}

static esp_err_t
  i2s_channel_read_8_stereo_to_mono_both(i2s_chan_handle_t handle, char *read_buff, void *dst, size_t len, size_t *bytes_read, uint32_t timeout_ms) {
  return i2s_channel_read_stereo_to_mono(handle, read_buff, dst, len, bytes_read, timeout_ms, 2, true);
}
#endif  // SOC_I2S_HW_VERSION_1

I2SClass::I2SClass(i2s_port_t port) {
  last_error = ESP_OK;
  _mode = I2S_MODE_MAX;  // Initialize to invalid mode to indicate I2S not started
  _port = port;

  tx_chan = NULL;
  tx_sample_rate = 0;
  tx_data_bit_width = I2S_DATA_BIT_WIDTH_16BIT;
  tx_slot_mode = I2S_SLOT_MODE_STEREO;

  rx_fn = i2s_channel_read_default;
  rx_transform = I2S_RX_TRANSFORM_NONE;
  rx_transform_buf = NULL;
  rx_transform_buf_len = 0;

  rx_chan = NULL;
  rx_sample_rate = 0;
  rx_data_bit_width = I2S_DATA_BIT_WIDTH_16BIT;
  rx_slot_mode = I2S_SLOT_MODE_STEREO;

  _role = I2S_ROLE_MASTER;
  _rx_slot_mask = I2S_STD_SLOT_LEFT;
#if SOC_I2S_HW_VERSION_1
  _mono_hw_workaround = false;
  _8bit_hw_packing = false;
#endif

  _mclk = -1;
  _bclk = -1;
  _ws = -1;
  _dout = -1;
  _din = -1;
  _mclk_inv = false;
  _bclk_inv = false;
  _ws_inv = false;

#if SOC_I2S_SUPPORTS_PDM_TX
  _tx_clk = -1;
  _tx_dout0 = -1;
  _tx_dout1 = -1;
  _tx_clk_inv = false;
#endif
#if SOC_I2S_SUPPORTS_PDM_RX
  _rx_clk = -1;
  _rx_din0 = -1;
  _rx_din1 = -1;
  _rx_din2 = -1;
  _rx_din3 = -1;
  _rx_clk_inv = false;
#endif
}

I2SClass::~I2SClass() {
  end();
}

bool I2SClass::i2sDetachBus(void *bus_pointer) {
  I2SClass *bus = (I2SClass *)bus_pointer;
  // Only call end() if I2S has been initialized (begin() was called)
  // _mode is set to I2S_MODE_MAX in constructor and to a valid mode in begin()
  if (bus->_mode < I2S_MODE_MAX) {
    bus->end();
  }
  return true;
}

bool I2SClass::setPort(i2s_port_t port) {
  if (_mode < I2S_MODE_MAX) {
    log_e("I2S port must be set before begin()");
    return false;
  }
  if (!isValidI2SPort(port)) {
    log_e("Invalid I2S port selected.");
    return false;
  }
  _port = port;
  return true;
}

i2s_port_t I2SClass::getPort() {
  i2s_chan_handle_t chan = tx_chan != NULL ? tx_chan : rx_chan;
  if (chan != NULL) {
    i2s_chan_info_t info;
    if (i2s_channel_get_info(chan, &info) == ESP_OK) {
      return info.id;
    }
  }
  return _port;
}

// Set pins for STD and TDM mode
void I2SClass::setPins(int8_t bclk, int8_t ws, int8_t dout, int8_t din, int8_t mclk) {
  _mclk = digitalPinToGPIONumber(mclk);
  _bclk = digitalPinToGPIONumber(bclk);
  _ws = digitalPinToGPIONumber(ws);
  _dout = digitalPinToGPIONumber(dout);
  _din = digitalPinToGPIONumber(din);
}

void I2SClass::setInverted(bool bclk, bool ws, bool mclk) {
  _mclk_inv = mclk;
  _bclk_inv = bclk;
  _ws_inv = ws;
}

// Set pins for PDM TX mode
#if SOC_I2S_SUPPORTS_PDM_TX
void I2SClass::setPinsPdmTx(int8_t clk, int8_t dout0, int8_t dout1) {
  _tx_clk = digitalPinToGPIONumber(clk);
  _tx_dout0 = digitalPinToGPIONumber(dout0);
#if (SOC_I2S_PDM_MAX_TX_LINES > 1)
  _tx_dout1 = digitalPinToGPIONumber(dout1);
#endif
}
#endif

// Set pins for PDM RX mode
#if SOC_I2S_SUPPORTS_PDM_RX
void I2SClass::setPinsPdmRx(int8_t clk, int8_t din0, int8_t din1, int8_t din2, int8_t din3) {
  _rx_clk = digitalPinToGPIONumber(clk);
  _rx_din0 = digitalPinToGPIONumber(din0);
#if (SOC_I2S_PDM_MAX_RX_LINES > 1)
  _rx_din1 = digitalPinToGPIONumber(din1);
  _rx_din2 = digitalPinToGPIONumber(din2);
  _rx_din3 = digitalPinToGPIONumber(din3);
#endif
}
#endif

#if SOC_I2S_SUPPORTS_PDM_TX || SOC_I2S_SUPPORTS_PDM_RX
void I2SClass::setInvertedPdm(bool clk) {
#if SOC_I2S_SUPPORTS_PDM_TX
  _tx_clk_inv = clk;
#endif
#if SOC_I2S_SUPPORTS_PDM_RX
  _rx_clk_inv = clk;
#endif
}
#endif

bool I2SClass::initSTD(uint32_t rate, i2s_data_bit_width_t bits_cfg, i2s_slot_mode_t ch, int8_t slot_mask) {
  // Peripheral manager deinit previous peripheral if pin was used
  if (_mclk >= 0) {
    if (!perimanClearPinBus(_mclk)) {
      return false;
    }
  }
  if (_bclk >= 0) {
    if (!perimanClearPinBus(_bclk)) {
      return false;
    }
  }
  if (_ws >= 0) {
    if (!perimanClearPinBus(_ws)) {
      return false;
    }
  }
  if (_dout >= 0) {
    if (!perimanClearPinBus(_dout)) {
      return false;
    }
  }
  if (_din >= 0) {
    if (!perimanClearPinBus(_din)) {
      return false;
    }
  }

  // Set peripheral manager detach function for I2S
  if (_mclk >= 0) {
    perimanSetBusDeinit(ESP32_BUS_TYPE_I2S_STD_MCLK, I2SClass::i2sDetachBus);
  }
  if (_bclk >= 0) {
    perimanSetBusDeinit(ESP32_BUS_TYPE_I2S_STD_BCLK, I2SClass::i2sDetachBus);
  }
  if (_ws >= 0) {
    perimanSetBusDeinit(ESP32_BUS_TYPE_I2S_STD_WS, I2SClass::i2sDetachBus);
  }
  if (_dout >= 0) {
    perimanSetBusDeinit(ESP32_BUS_TYPE_I2S_STD_DOUT, I2SClass::i2sDetachBus);
  }
  if (_din >= 0) {
    perimanSetBusDeinit(ESP32_BUS_TYPE_I2S_STD_DIN, I2SClass::i2sDetachBus);
  }

  // I2S configuration
  i2s_chan_config_t chan_cfg = I2S_DEFAULT_CFG(_port);
  chan_cfg.role = _role;
  if (_dout >= 0 && _din >= 0) {
    I2S_ERROR_CHECK_RETURN_FALSE(i2s_new_channel(&chan_cfg, &tx_chan, &rx_chan));
  } else if (_dout >= 0) {
    I2S_ERROR_CHECK_RETURN_FALSE(i2s_new_channel(&chan_cfg, &tx_chan, NULL));
  } else if (_din >= 0) {
    I2S_ERROR_CHECK_RETURN_FALSE(i2s_new_channel(&chan_cfg, NULL, &rx_chan));
  }

  i2s_std_config_t i2s_config = I2S_STD_CHAN_CFG(rate, bits_cfg, ch);
  if (slot_mask >= 0 && (i2s_std_slot_mask_t)slot_mask <= I2S_STD_SLOT_BOTH) {
    i2s_config.slot_cfg.slot_mask = (i2s_std_slot_mask_t)slot_mask;
  }
  if (slot_mask == I2S_STD_SLOT_RIGHT) {
    _rx_slot_mask = I2S_STD_SLOT_RIGHT;
  } else if (slot_mask == I2S_STD_SLOT_BOTH || (ch == I2S_SLOT_MODE_STEREO && slot_mask < 0)) {
    _rx_slot_mask = I2S_STD_SLOT_BOTH;
  } else {
    _rx_slot_mask = I2S_STD_SLOT_LEFT;
  }
#if SOC_I2S_HW_VERSION_1
  // ESP32 HW v1: DMA uses 2 bytes per sample for 8-bit data (high byte valid).
  // Mono FIFO packing is also broken for 8/16-bit.  Work around both issues by
  // packing 8-bit in software and forcing stereo for mono.
  _8bit_hw_packing = (bits_cfg == I2S_DATA_BIT_WIDTH_8BIT);
  if (ch == I2S_SLOT_MODE_MONO && (bits_cfg == I2S_DATA_BIT_WIDTH_16BIT || bits_cfg == I2S_DATA_BIT_WIDTH_8BIT)) {
    _mono_hw_workaround = true;
    i2s_config.slot_cfg.slot_mode = I2S_SLOT_MODE_STEREO;
    i2s_config.slot_cfg.slot_mask = I2S_STD_SLOT_BOTH;
  } else {
    _mono_hw_workaround = false;
  }
#else
  // Newer targets default to SLOT_BOTH even in mono, which doubles each
  // sample in the DMA buffer.  Force SLOT_LEFT for true mono unless the
  // caller explicitly overrode slot_mask.
  if (ch == I2S_SLOT_MODE_MONO && slot_mask < 0) {
    i2s_config.slot_cfg.slot_mask = I2S_STD_SLOT_LEFT;
  }
#endif
  if (tx_chan != NULL) {
    tx_sample_rate = rate;
    tx_data_bit_width = bits_cfg;
    tx_slot_mode = ch;
    I2S_ERROR_CHECK_RETURN_FALSE(i2s_channel_init_std_mode(tx_chan, &i2s_config));
    I2S_ERROR_CHECK_RETURN_FALSE(i2s_channel_enable(tx_chan));
  }
  if (rx_chan != NULL) {
    if (ch == I2S_SLOT_MODE_STEREO) {
      i2s_config.slot_cfg.slot_mask = I2S_STD_SLOT_BOTH;
      _rx_slot_mask = I2S_STD_SLOT_BOTH;
    }
    rx_sample_rate = rate;
    rx_data_bit_width = bits_cfg;
    rx_slot_mode = ch;
    I2S_ERROR_CHECK_RETURN_FALSE(i2s_channel_init_std_mode(rx_chan, &i2s_config));
    I2S_ERROR_CHECK_RETURN_FALSE(i2s_channel_enable(rx_chan));
#if SOC_I2S_HW_VERSION_1
    if (_mono_hw_workaround) {
      if (_8bit_hw_packing) {
        // 8-bit mono: DMA produces stereo uint16_t (4 bytes per mono sample)
        if (!allocTranformRX(I2S_READ_CHUNK_SIZE * 4)) {
          goto err;
        }
        if (_rx_slot_mask == I2S_STD_SLOT_RIGHT) {
          rx_fn = i2s_channel_read_8_stereo_to_mono_right;
        } else if (_rx_slot_mask == I2S_STD_SLOT_BOTH) {
          rx_fn = i2s_channel_read_8_stereo_to_mono_both;
        } else {
          rx_fn = i2s_channel_read_8_stereo_to_mono_left;
        }
      } else {
        if (!allocTranformRX(I2S_READ_CHUNK_SIZE * 2)) {
          goto err;
        }
        if (_rx_slot_mask == I2S_STD_SLOT_RIGHT) {
          rx_fn = i2s_channel_read_16_stereo_to_mono_right;
        } else if (_rx_slot_mask == I2S_STD_SLOT_BOTH) {
          rx_fn = i2s_channel_read_16_stereo_to_mono_both;
        } else {
          rx_fn = i2s_channel_read_16_stereo_to_mono_left;
        }
      }
      rx_transform = I2S_RX_TRANSFORM_16_STEREO_TO_MONO;
    } else if (_8bit_hw_packing) {
      // 8-bit stereo: DMA produces uint16_t per sample (2× user bytes)
      if (!allocTranformRX(I2S_READ_CHUNK_SIZE * 2)) {
        goto err;
      }
      rx_fn = i2s_channel_read_8_unpack;
      rx_transform = I2S_RX_TRANSFORM_8_UNPACK;
    }
#endif
  }

  // Peripheral manager set bus type to I2S
  if (_mclk >= 0) {
    if (!perimanSetPinBus(_mclk, ESP32_BUS_TYPE_I2S_STD_MCLK, (void *)(this), -1, -1)) {
      goto err;
    }
  }
  if (_bclk >= 0) {
    if (!perimanSetPinBus(_bclk, ESP32_BUS_TYPE_I2S_STD_BCLK, (void *)(this), -1, -1)) {
      goto err;
    }
  }
  if (_ws >= 0) {
    if (!perimanSetPinBus(_ws, ESP32_BUS_TYPE_I2S_STD_WS, (void *)(this), -1, -1)) {
      goto err;
    }
  }
  if (_dout >= 0) {
    if (!perimanSetPinBus(_dout, ESP32_BUS_TYPE_I2S_STD_DOUT, (void *)(this), -1, -1)) {
      goto err;
    }
  }
  if (_din >= 0) {
    if (!perimanSetPinBus(_din, ESP32_BUS_TYPE_I2S_STD_DIN, (void *)(this), -1, -1)) {
      goto err;
    }
  }

