espressif/arduino-esp32/libraries/ESP_I2S/src/ESP_I2S.cpp
  return true;
err:
  log_e("Failed to set all pins bus to I2S_TDM");
  I2SClass::i2sDetachBus((void *)(this));
  return false;
}
#endif

bool I2SClass::begin(i2s_mode_t mode, uint32_t rate, i2s_data_bit_width_t bits_cfg, i2s_slot_mode_t ch, int8_t slot_mask, i2s_role_t role) {
  /* Setup I2S peripheral */
  if (mode >= I2S_MODE_MAX) {
    log_e("Invalid I2S mode selected.");
    return false;
  }
  if (!isValidI2SPort(_port)) {
    log_e("Invalid I2S port selected.");
    return false;
  }
  _mode = mode;
  _role = role;

  bool init = false;
  switch (_mode) {
    case I2S_MODE_STD: init = initSTD(rate, bits_cfg, ch, slot_mask); break;
#if SOC_I2S_SUPPORTS_TDM
    case I2S_MODE_TDM: init = initTDM(rate, bits_cfg, ch, slot_mask); break;
#endif
#if SOC_I2S_SUPPORTS_PDM_TX
    case I2S_MODE_PDM_TX: init = initPDMtx(rate, bits_cfg, ch); break;
#endif
#if SOC_I2S_SUPPORTS_PDM_RX
    case I2S_MODE_PDM_RX: init = initPDMrx(rate, bits_cfg, ch); break;
#endif
    default: break;
  }

  if (init == false) {
    log_e("I2S initialization failed.");
    return false;
  }
  return true;
}

bool I2SClass::end() {
  // Check if already ended to prevent recursion
  if (_mode >= I2S_MODE_MAX) {
    return true;
  }

  // Save mode and reset it BEFORE clearing pins to prevent recursive calls
  // When perimanClearPinBus() is called, it may trigger i2sDetachBus() again
  i2s_mode_t mode = _mode;
  _mode = I2S_MODE_MAX;

  if (tx_chan != NULL) {
    I2S_ERROR_CHECK_RETURN_FALSE(i2s_channel_disable(tx_chan));
    I2S_ERROR_CHECK_RETURN_FALSE(i2s_del_channel(tx_chan));
    tx_chan = NULL;
  }
  if (rx_chan != NULL) {
    I2S_ERROR_CHECK_RETURN_FALSE(i2s_channel_disable(rx_chan));
    I2S_ERROR_CHECK_RETURN_FALSE(i2s_del_channel(rx_chan));
    rx_chan = NULL;
  }
  if (rx_transform_buf != NULL) {
    free(rx_transform_buf);
    rx_transform_buf = NULL;
    rx_transform_buf_len = 0;
  }
  rx_fn = i2s_channel_read_default;
  rx_transform = I2S_RX_TRANSFORM_NONE;
#if SOC_I2S_HW_VERSION_1
  _mono_hw_workaround = false;
  _8bit_hw_packing = false;
#endif

  //Peripheral manager deinit used pins
  switch (mode) {
    case I2S_MODE_STD:
#if SOC_I2S_SUPPORTS_TDM
    case I2S_MODE_TDM:
#endif
      if (_mclk >= 0) {
        perimanClearPinBus(_mclk);
      }
      if (_bclk >= 0) {
        perimanClearPinBus(_bclk);
      }
      if (_ws >= 0) {
        perimanClearPinBus(_ws);
      }
      if (_dout >= 0) {
        perimanClearPinBus(_dout);
      }
      if (_din >= 0) {
        perimanClearPinBus(_din);
      }
      break;
#if SOC_I2S_SUPPORTS_PDM_TX
    case I2S_MODE_PDM_TX:
      perimanClearPinBus(_tx_clk);
      if (_tx_dout0 >= 0) {
        perimanClearPinBus(_tx_dout0);
      }
      if (_tx_dout1 >= 0) {
        perimanClearPinBus(_tx_dout1);
      }
      break;
#endif
#if SOC_I2S_SUPPORTS_PDM_RX
    case I2S_MODE_PDM_RX:
      perimanClearPinBus(_rx_clk);
      if (_rx_din0 >= 0) {
        perimanClearPinBus(_rx_din0);
      }
      if (_rx_din1 >= 0) {
        perimanClearPinBus(_rx_din1);
      }
      if (_rx_din2 >= 0) {
        perimanClearPinBus(_rx_din2);
      }
      if (_rx_din3 >= 0) {
        perimanClearPinBus(_rx_din3);
      }
      break;
#endif
    default: break;
  }
  return true;
}

bool I2SClass::configureTX(uint32_t rate, i2s_data_bit_width_t bits_cfg, i2s_slot_mode_t ch, int8_t slot_mask) {
  /* Setup I2S channels */
  if (tx_chan != NULL) {
    if (tx_sample_rate == rate && tx_data_bit_width == bits_cfg && tx_slot_mode == ch) {
      return true;
    }
    i2s_std_config_t i2s_config = I2S_STD_CHAN_CFG(rate, bits_cfg, ch);
    if (slot_mask >= 0 && (i2s_std_slot_mask_t)slot_mask <= I2S_STD_SLOT_BOTH) {
      i2s_config.slot_cfg.slot_mask = (i2s_std_slot_mask_t)slot_mask;
    }
#if SOC_I2S_HW_VERSION_1
    _8bit_hw_packing = (bits_cfg == I2S_DATA_BIT_WIDTH_8BIT);
    if (ch == I2S_SLOT_MODE_MONO && (bits_cfg == I2S_DATA_BIT_WIDTH_16BIT || bits_cfg == I2S_DATA_BIT_WIDTH_8BIT)) {
      _mono_hw_workaround = true;
      i2s_config.slot_cfg.slot_mode = I2S_SLOT_MODE_STEREO;
      i2s_config.slot_cfg.slot_mask = I2S_STD_SLOT_BOTH;
    } else {
      _mono_hw_workaround = false;
    }
#else
    if (ch == I2S_SLOT_MODE_MONO && slot_mask < 0) {
      i2s_config.slot_cfg.slot_mask = I2S_STD_SLOT_LEFT;
    }
#endif
    I2S_ERROR_CHECK_RETURN_FALSE(i2s_channel_disable(tx_chan));
    I2S_ERROR_CHECK_RETURN_FALSE(i2s_channel_reconfig_std_clock(tx_chan, &i2s_config.clk_cfg));
    tx_sample_rate = rate;
    I2S_ERROR_CHECK_RETURN_FALSE(i2s_channel_reconfig_std_slot(tx_chan, &i2s_config.slot_cfg));
    tx_data_bit_width = bits_cfg;
    tx_slot_mode = ch;
    I2S_ERROR_CHECK_RETURN_FALSE(i2s_channel_enable(tx_chan));
    return true;
  }
  return false;
}

bool I2SClass::configureRX(uint32_t rate, i2s_data_bit_width_t bits_cfg, i2s_slot_mode_t ch, i2s_rx_transform_t transform, int8_t slot_mask) {
  /* Setup I2S channels */
  if (rx_chan != NULL) {
    if (rx_sample_rate != rate || rx_data_bit_width != bits_cfg || rx_slot_mode != ch) {
      i2s_std_config_t i2s_config = I2S_STD_CHAN_CFG(rate, bits_cfg, ch);
      if (ch == I2S_SLOT_MODE_STEREO) {
        i2s_config.slot_cfg.slot_mask = I2S_STD_SLOT_BOTH;
        _rx_slot_mask = I2S_STD_SLOT_BOTH;
      } else if (slot_mask >= 0 && (i2s_std_slot_mask_t)slot_mask <= I2S_STD_SLOT_BOTH) {
        i2s_config.slot_cfg.slot_mask = (i2s_std_slot_mask_t)slot_mask;
        _rx_slot_mask = (i2s_std_slot_mask_t)slot_mask;
      } else {
        // slot_mask = -1 (default) in mono: preserve current _rx_slot_mask,
        // but reset to LEFT if transitioning from stereo (where BOTH was forced).
        if (rx_slot_mode != I2S_SLOT_MODE_MONO && _rx_slot_mask != I2S_STD_SLOT_LEFT) {
          log_w("configureRX: switching from stereo to mono with no explicit slot_mask; defaulting to LEFT");
          _rx_slot_mask = I2S_STD_SLOT_LEFT;
        }
        i2s_config.slot_cfg.slot_mask = _rx_slot_mask;
      }
#if SOC_I2S_HW_VERSION_1
      _8bit_hw_packing = (bits_cfg == I2S_DATA_BIT_WIDTH_8BIT);
      bool new_workaround = (ch == I2S_SLOT_MODE_MONO && (bits_cfg == I2S_DATA_BIT_WIDTH_16BIT || bits_cfg == I2S_DATA_BIT_WIDTH_8BIT));
      if (new_workaround) {
        _mono_hw_workaround = true;
        i2s_config.slot_cfg.slot_mode = I2S_SLOT_MODE_STEREO;
        i2s_config.slot_cfg.slot_mask = I2S_STD_SLOT_BOTH;
      } else {
        _mono_hw_workaround = false;
      }
#endif
      I2S_ERROR_CHECK_RETURN_FALSE(i2s_channel_disable(rx_chan));
      I2S_ERROR_CHECK_RETURN_FALSE(i2s_channel_reconfig_std_clock(rx_chan, &i2s_config.clk_cfg));
      rx_sample_rate = rate;
      I2S_ERROR_CHECK_RETURN_FALSE(i2s_channel_reconfig_std_slot(rx_chan, &i2s_config.slot_cfg));
      rx_data_bit_width = bits_cfg;
      rx_slot_mode = ch;
      I2S_ERROR_CHECK_RETURN_FALSE(i2s_channel_enable(rx_chan));
#if SOC_I2S_HW_VERSION_1
      if (_mono_hw_workaround) {
        if (_8bit_hw_packing) {
          if (!allocTranformRX(I2S_READ_CHUNK_SIZE * 4)) {
            return false;
          }
          if (_rx_slot_mask == I2S_STD_SLOT_RIGHT) {
            rx_fn = i2s_channel_read_8_stereo_to_mono_right;
          } else if (_rx_slot_mask == I2S_STD_SLOT_BOTH) {
            rx_fn = i2s_channel_read_8_stereo_to_mono_both;
          } else {
            rx_fn = i2s_channel_read_8_stereo_to_mono_left;
          }
        } else {
          if (!allocTranformRX(I2S_READ_CHUNK_SIZE * 2)) {
            return false;
          }
          if (_rx_slot_mask == I2S_STD_SLOT_RIGHT) {
            rx_fn = i2s_channel_read_16_stereo_to_mono_right;
          } else if (_rx_slot_mask == I2S_STD_SLOT_BOTH) {
            rx_fn = i2s_channel_read_16_stereo_to_mono_both;
          } else {
            rx_fn = i2s_channel_read_16_stereo_to_mono_left;
          }
        }
        rx_transform = I2S_RX_TRANSFORM_16_STEREO_TO_MONO;
        return true;
      } else if (_8bit_hw_packing) {
        if (!allocTranformRX(I2S_READ_CHUNK_SIZE * 2)) {
          return false;
        }
        rx_fn = i2s_channel_read_8_unpack;
        rx_transform = I2S_RX_TRANSFORM_8_UNPACK;
        return true;
      }
#endif
      return transformRX(transform);
    }
    // Slot-only change: rate/bits/ch unchanged but slot_mask or transform changed.
    // Stereo RX always uses BOTH — the IDF does not reliably ignore slot_mask
    // in stereo mode, so slot changes are only meaningful for mono.
    if (ch != I2S_SLOT_MODE_STEREO && slot_mask >= 0 && (i2s_std_slot_mask_t)slot_mask != _rx_slot_mask) {
      i2s_std_config_t i2s_config = I2S_STD_CHAN_CFG(rate, bits_cfg, ch);
      i2s_config.slot_cfg.slot_mask = (i2s_std_slot_mask_t)slot_mask;
      if (slot_mask == I2S_STD_SLOT_RIGHT) {
        _rx_slot_mask = I2S_STD_SLOT_RIGHT;
      } else if (slot_mask == I2S_STD_SLOT_BOTH) {
        _rx_slot_mask = I2S_STD_SLOT_BOTH;
      } else {
        _rx_slot_mask = I2S_STD_SLOT_LEFT;
      }
#if SOC_I2S_HW_VERSION_1
      if (_mono_hw_workaround) {
        i2s_config.slot_cfg.slot_mode = I2S_SLOT_MODE_STEREO;
        i2s_config.slot_cfg.slot_mask = I2S_STD_SLOT_BOTH;
      }
#endif
      I2S_ERROR_CHECK_RETURN_FALSE(i2s_channel_disable(rx_chan));
      I2S_ERROR_CHECK_RETURN_FALSE(i2s_channel_reconfig_std_slot(rx_chan, &i2s_config.slot_cfg));
      I2S_ERROR_CHECK_RETURN_FALSE(i2s_channel_enable(rx_chan));
#if SOC_I2S_HW_VERSION_1
      if (_mono_hw_workaround) {
        if (_8bit_hw_packing) {
          if (!allocTranformRX(I2S_READ_CHUNK_SIZE * 4)) {
            return false;
          }
          if (_rx_slot_mask == I2S_STD_SLOT_RIGHT) {
            rx_fn = i2s_channel_read_8_stereo_to_mono_right;
          } else if (_rx_slot_mask == I2S_STD_SLOT_BOTH) {
            rx_fn = i2s_channel_read_8_stereo_to_mono_both;
          } else {
            rx_fn = i2s_channel_read_8_stereo_to_mono_left;
          }
        } else {
          if (!allocTranformRX(I2S_READ_CHUNK_SIZE * 2)) {
            return false;
          }
          if (_rx_slot_mask == I2S_STD_SLOT_RIGHT) {
            rx_fn = i2s_channel_read_16_stereo_to_mono_right;
          } else if (_rx_slot_mask == I2S_STD_SLOT_BOTH) {
            rx_fn = i2s_channel_read_16_stereo_to_mono_both;
          } else {
            rx_fn = i2s_channel_read_16_stereo_to_mono_left;
          }
        }
        rx_transform = I2S_RX_TRANSFORM_16_STEREO_TO_MONO;
        return true;
      }
#endif
    }
    if (rx_transform != transform) {
      return transformRX(transform);
    }
    return true;
  }
  return false;
}

size_t I2SClass::readBytes(char *buffer, size_t size) {
  size_t bytes_read = 0;
  size_t bytes_to_read = 0;
  size_t total_size = 0;
  last_error = ESP_FAIL;
  if (rx_chan == NULL) {
    return total_size;
  }
  while (total_size < size) {
    bytes_read = 0;
    bytes_to_read = size - total_size;
    if (rx_transform_buf != NULL && bytes_to_read > I2S_READ_CHUNK_SIZE) {
      bytes_to_read = I2S_READ_CHUNK_SIZE;
    }
    I2S_ERROR_CHECK_RETURN(rx_fn(rx_chan, rx_transform_buf, (char *)(buffer + total_size), bytes_to_read, &bytes_read, _timeout), 0);
    total_size += bytes_read;
  }
  return total_size;
}

size_t I2SClass::write(const uint8_t *buffer, size_t size) {
  return write((const void *)buffer, size);
}

size_t I2SClass::write(const void *buffer, size_t size) {
  const uint8_t *data = (const uint8_t *)buffer;
  size_t written = 0;
  size_t bytes_sent = 0;
  size_t bytes_to_send = 0;
  last_error = ESP_FAIL;
  if (tx_chan == NULL) {
    return written;
  }
  size_t min_size = (tx_data_bit_width == I2S_DATA_BIT_WIDTH_8BIT) ? 1 : (tx_data_bit_width / 8);
  if (size < min_size) {
    log_w("I2S write ignored: %u byte(s) is less than the %u-byte minimum for %u-bit PCM", (unsigned)size, (unsigned)min_size, (unsigned)tx_data_bit_width);
    last_error = ESP_OK;
    return 0;
  }
#if SOC_I2S_HW_VERSION_1
  if (_8bit_hw_packing && _mono_hw_workaround) {
    // 8-bit mono on HW v1: pack each int8_t sample into the high byte of
    // a uint16_t, then duplicate into L+R stereo for DMA.
    const int8_t *src = (const int8_t *)data;
    size_t mono_samples = size;
    size_t mono_written = 0;
    while (mono_written < mono_samples) {
      const size_t MAX_CHUNK = 128;
      uint16_t stereo_buf[MAX_CHUNK * 2];
      size_t chunk = mono_samples - mono_written;
      if (chunk > MAX_CHUNK) {
        chunk = MAX_CHUNK;
      }
      for (size_t i = 0; i < chunk; i++) {
        uint16_t packed = (uint16_t)((uint8_t)src[mono_written + i]) << 8;
        stereo_buf[i * 2] = packed;
        stereo_buf[i * 2 + 1] = packed;
      }
      size_t stereo_bytes = chunk * 2 * sizeof(uint16_t);
      bytes_sent = 0;
      esp_err_t err = i2s_channel_write(tx_chan, (char *)stereo_buf, stereo_bytes, &bytes_sent, _timeout);
      setWriteError(err);
      if (err != ESP_OK) {
        last_error = err;
        break;
      }
      mono_written += bytes_sent / (2 * sizeof(uint16_t));
    }
    if (mono_written == mono_samples) {
      last_error = ESP_OK;
    }
    return mono_written;
  }
  if (_8bit_hw_packing && !_mono_hw_workaround) {
    // 8-bit stereo on HW v1: pack each int8_t into the high byte of a uint16_t.
    const int8_t *src = (const int8_t *)data;
    size_t n_samples = size;
    size_t samples_written = 0;
    while (samples_written < n_samples) {
      const size_t MAX_CHUNK = 256;
      uint16_t pack_buf[MAX_CHUNK];
      size_t chunk = n_samples - samples_written;
      if (chunk > MAX_CHUNK) {
        chunk = MAX_CHUNK;
      }
      for (size_t i = 0; i < chunk; i++) {
        pack_buf[i] = (uint16_t)((uint8_t)src[samples_written + i]) << 8;
      }
      size_t pack_bytes = chunk * sizeof(uint16_t);
      bytes_sent = 0;
      esp_err_t err = i2s_channel_write(tx_chan, (char *)pack_buf, pack_bytes, &bytes_sent, _timeout);
      setWriteError(err);
      if (err != ESP_OK) {
        last_error = err;
        break;
      }
      samples_written += bytes_sent / sizeof(uint16_t);
    }
    if (samples_written == n_samples) {
      last_error = ESP_OK;
    }
    return samples_written;
  }
  if (_mono_hw_workaround) {
    const int16_t *src = (const int16_t *)data;
    size_t mono_samples = size / sizeof(int16_t);
    size_t mono_written = 0;
    while (mono_written < mono_samples) {
      const size_t MAX_CHUNK = 128;
      int16_t stereo_buf[MAX_CHUNK * 2];
      size_t chunk = mono_samples - mono_written;
      if (chunk > MAX_CHUNK) {
        chunk = MAX_CHUNK;
      }
      for (size_t i = 0; i < chunk; i++) {
        stereo_buf[i * 2] = src[mono_written + i];
        stereo_buf[i * 2 + 1] = src[mono_written + i];
      }
      size_t stereo_bytes = chunk * 2 * sizeof(int16_t);
      bytes_sent = 0;
      esp_err_t err = i2s_channel_write(tx_chan, (char *)stereo_buf, stereo_bytes, &bytes_sent, _timeout);
      setWriteError(err);
      if (err != ESP_OK) {
        last_error = err;
        break;
      }
      mono_written += bytes_sent / (2 * sizeof(int16_t));
    }
    if (mono_written == mono_samples) {
      last_error = ESP_OK;
    }
    return mono_written * sizeof(int16_t);
  }
#endif
  while (written < size) {
    bytes_sent = 0;
    bytes_to_send = size - written;
    esp_err_t err = i2s_channel_write(tx_chan, (char *)(data + written), bytes_to_send, &bytes_sent, _timeout);
    setWriteError(err);
    I2S_ERROR_CHECK_RETURN(err, written);
    written += bytes_sent;
  }
  return written;
}

i2s_chan_handle_t I2SClass::txChan() {
  return tx_chan;
}
uint32_t I2SClass::txSampleRate() {
  return tx_sample_rate;
}
i2s_data_bit_width_t I2SClass::txDataWidth() {
  return tx_data_bit_width;
}
i2s_slot_mode_t I2SClass::txSlotMode() {
  return tx_slot_mode;
}

